{"data":{"markdownRemark":{"html":"<p>I worked as a full-stack subcontractor on a small team tasked with launching the 2018 redesign of <a href=\"https://criterion.com\">criterion.com</a>.</p>\n<p>The team was contracted to pick up where a prior agency had left off, inheriting a beautifully-designed set of front end templates and a partially completed back end build.</p>\n<p>The new site was launched in May, and we are currently at work building and releasing new rounds of post-launch features.</p>\n<h2>The Stack</h2>\n<ul>\n<li>Laravel 5 and PostgreSQL</li>\n<li>Sass and (almost entirely) vanilla JS, compiled with Gulp</li>\n<li>Deployed on Heroku, S3, and AWS RDS</li>\n<li>Homestead development environment</li>\n</ul>\n<h2>My Role</h2>\n<p>As our work began, my largest responsibilities revolved around three areas:</p>\n<ul>\n<li>interviewing stakeholders to gather requirements, understand everyone's workflows, and align expectations</li>\n<li>work with the previous development team to gain a thorough understanding of the existing work and the scope that remained</li>\n<li>planning and configuring the team's development workflow and deployment pipeline</li>\n<li>planning and executing a migration of the existing site's database content to the new site's updated structure.</li>\n</ul>\n<p>Additionally, I've shipped features including homepage CMS integration, CSV reporting, order cancelling, v1 to v2 URL migrations and redirects, and many different front end bug fixes and enhancements.</p>\n<h2>Trusting the Process</h2>\n<p>While we've had our fair share of tricky technical puzzles, the heart of this project has been the team's effort to radically improve transparency and communication with the client stakeholders.</p>\n<p>We employ weekly scrum planning, post-sprint demos, kanban-style issue tracking, and commitment to regular backlog grooming sessions with the Criterion team.</p>\n<p>The system is supported from a development standpoint using a Git Flow approach paired with Heroku's brilliant Review Apps feature, which allows us to stand up live builds of any Pull Request for the Criterion team to review. Once a set of Acceptance Criteria is validated, each branch is staged for inclusion in a post-sprint release.</p>\n<p>Without a strong project management process, creating a window into the team's progress and developing a shared understanding of this project's scope would be daunting. An agile approach, coupled with a high degree of sprint visibility and direct collaboration from the stakeholders, has been critical in collectively defining and understanding a shared vision of success.</p>\n<h2>Lessons</h2>\n<p>I am incredibly lucky to work with this team and the exceptional people at Criterion, who have been enthusastic and focused partners throughout this project. They have consistently shown me the dividends of including regular stakeholder feedback as a fundamental part of the development process. Some of the big wins we've shared throughout this approach:</p>\n<ul>\n<li>No more big surprises. If the team runs into a particularly hairy issue or an increase in scope, our sprint planning board acts as a shared playbook that shows us how to proceed. By virtue of being directly involved in the planning process, the client stays informed and keeps a handle on how the changes affect the project as a whole.</li>\n<li>Scope discussions become much easier. We can track exactly how much work is possible within a given sprint, and plan our weeks around that metric. As priorities shift, we have to work together to determine which tasks get bumped to subsequent sprints, and which features might need to be deprioritized in order to meet a deadline.</li>\n<li>The client is able to plan external business decisions around the pace of development, since we now have a quantifiable view of effort and velocity.</li>\n<li>The process is hardly something that runs itself. Strong project management is required to keep it on track, because commitment and consistency is what ultimately makes this approach effective and reliable.</li>\n</ul>","fields":{"slug":"/work/criterion/"},"frontmatter":{"title":"The Criterion Collection"}}},"pageContext":{"slug":"/work/criterion/","prev":null,"next":{"fields":{"slug":"/redds"},"frontmatter":{"draft":false}}}}